---
kind: method
id: M:Autodesk.Revit.DB.ExportDWGSettings.SetDXFExportOptions(Autodesk.Revit.DB.DXFExportOptions)
source: html/0936653b-e358-404e-17cc-70cc6341dcb0.htm
---
# Autodesk.Revit.DB.ExportDWGSettings.SetDXFExportOptions Method

Sets the options stored in these settings.

## Syntax (C#)
```csharp
public void SetDXFExportOptions(
	DXFExportOptions options
)
```

## Parameters
- **options** (`Autodesk.Revit.DB.DXFExportOptions`) - The options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null